0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    inlet
    {
        type        fixedValue;
		value 		uniform 300;
    }
	outlet
	{
		type		zeroGradient;
		
	}

    bottom
    {
        type            uniformFixedGradient;
        uniformGradient constant 1000;
    }
	
	top
	{
		type 		zeroGradient;
		
	
	}

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
