system/probes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

probes
{
// Where to load it from
functionObjectLibs ( "libsampling.so" );

type        probes;

// Name of the directory for probe data
name        probes;

// Fields to be probed
fields (
        p 
        U
		T 
       );

probeLocations
(
(	0.495439141	0.047287425	0.05	)
(	0.231671417	0.031751702	0.05	)
(	0.232471176	0.052290843	0.05	)
(	0.964759383	0.099425757	0.05	)
(	0.156825594	0.089789804	0.05	)
(	0.120568999	0.097880861	0.05	)
(	0.242104018	0.008181957	0.05	)
(	0.787625448	0.060289309	0.05	)
(	0.69936359	0.097200673	0.05	)
(	0.023128287	0.090711533	0.05	)



);
}
// ************************************************************************* //