system/sample
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sample;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type sets;
libs            ("libsampling.so");

interpolationScheme cellPoint;

setFormat       csv;
fields          (U p T);
writeControl    writeTime;
writeInterval   1;

sets
(
    /*
	vert_1
    {
        type    uniform;
        axis    y;
        start   (0.5 0 0.05);
        end     (0.5 0.1 0.05);
        nPoints 10;
    }

    horiz_1
    {
        type    uniform;
        axis    x;
        start   (0 0.05 0.05);
        end     (1 0.05 0.05);
        nPoints 50;
    }
	*/
	
	cloud1
    {
        type    cloud;
        axis    xyz;
        points
		(
			(	0.968138933	0.082150833	0.05	)
			(	0.882585944	0.011639427	0.05	)
			(	0.45414806	0.032857964	0.05	)
			(	0.56451637	0.050621681	0.05	)
			(	0.478469926	0.022809038	0.05	)
			(	0.962250226	0.025398243	0.05	)
			(	0.491861987	0.042487949	0.05	)
			(	0.726247677	0.06450302	0.05	)
			(	0.970313617	0.051930232	0.05	)
			(	0.353223937	0.054412733	0.05	)
			(	0.524925395	0.001134917	0.05	)
			(	0.596515297	0.019095717	0.05	)
			(	0.386045232	0.033155348	0.05	)
			(	0.416581176	0.061876942	0.05	)
			(	0.090877056	0.084565441	0.05	)
			(	0.141056472	0.060802229	0.05	)
			(	0.012712338	0.055099635	0.05	)
			(	0.147565356	0.01760862	0.05	)
			(	0.252699551	0.080065548	0.05	)
			(	0.524338877	0.032269092	0.05	)




		);
    }
	
	
);



// ************************************************************************* //
